teamHytta/app/controllers/posts_controller.rb

INSERT INTO "posts" ("cabin_id", "created_at", "message", "updated_at") VALUES (?, ?, ?, ?)  [["cabin_id", 0], ["created_at", "2014-10-24 00:17:24.699327"], ["message", "asdfasdfasd"], ["updated_at", "2014-10-24 00:17:24.699327"]]
---
  def create
    @post = Post.new(post_params)
    @post.save