app/controllers/cabins_controller.rb

SELECT "cabins".* FROM "cabins"
---
  def index
    #@cabins = Cabin.all
    @cabins = Cabin.paginate(:page => params[:page], :per_page => 30)

INSERT INTO "cabins" ("address", "created_at", "descritpion", "navn", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "asdf"], ["created_at", "2014-10-24 00:08:51.440581"], ["descritpion", ""], ["navn", "tk"], ["updated_at", "2014-10-24 00:08:51.440581"]]
---
  def create
    @cabin = Cabin.new(cabin_params)
    @cabin.user = current_user
    @cabin.save

DELETE FROM "cabins" WHERE "cabins"."id" = ?  [["id", 4]]
---
  def destroy
    @cabin.destroy

SELECT  "cabins".* FROM "cabins"  WHERE "cabins"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_cabin
      @cabin = Cabin.find(params[:id])