app/controllers/comments_controller.rb

INSERT INTO "comments" ("cabins_id", "created_at", "message", "updated_at") VALUES (?, ?, ?, ?)  [["cabins_id", 0], ["created_at", "2014-10-23 23:56:02.117833"], ["message", "asdf"], ["updated_at", "2014-10-23 23:56:02.117833"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.save